__author__ = 'Semidotskiy Aleksey'

# Задача-1: Ввести ваше имя и возраст в отдельные переменные,
# вычесть из возраста 18 и вывести на экран в следующем виде:
# "Василий на 2 года/лет больше 18"
# по желанию сделать адаптивный вывод, то есть "на 5 лет больше", "на 3 года меньше" и.т.д.

# TODO: код пишем тут...
name = input('введите ваше имя : ')
age = int(input('Введите ваш возраст : '))

print(name, 'на', age - 18, 'года/лет больше 18')
